// 1. unenq income anunov popoxakan,
// ete income 50 ic metc e consolum tpel "доход больше 50"
// var income = 100;








// 2.unenq erku popoxakan ete income poqr e 150-ic ev age 15-metc e consolum tpel "доход больше 50"
// var income = 100;
// var age = 19;










// 3.grel payman vor stugi  t anunov popoxakan ka ete ka alert ani true ete chka html tpi false











// 4. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.















// 5. В переменной min лежит число от 0 до 59. 
// Определите в какую четверть часа попадает это число (в первую, вторую, третью или четвертую)

















// 6.Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
// Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
















// 7.Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при a, равном 5, 0, -3, 2

















// 8.Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных,
// иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.

















// 9.Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти,
// то выведите 'Верно', в противном случае выведите 'Неверно'.