// 1)Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.








// 2)В переменной min лежит число от 0 до 59. Определите в какую четверть часа 
//   попадает это число (в первую, вторую, третью или четвертую)









// 3)Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'.









// 4)Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'.











// 5) Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'.











// 6)Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'.
//  Проверьте работу скрипта при test, равном true, false.











// 7)Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'.
//  Проверьте работу скрипта при a, равном 5, 0, -3, 2.













// 8)Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
//  Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.












// 9)Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных,
//  иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.













// 10)Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти,
//  то выведите 'Верно', в противном случае выведите 'Неверно'.













// 11)В переменной month лежит какое-то число из интервала от 1 до 12. 
//   Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).













// 12)В переменной a лежит какое-то число из интервала от 1 до 24.Если время меньше 10:00,
//  создайте приветствие «Доброе утро», если нет, но время меньше 20:00,
// создайте приветствие «Добрый день», иначе «Добрый вечер»: