// 1.Выведите на экран 10 раз фразу "You are welcome!"








// 2.Выведите на экран числа 1, 2, 3, 4, ..., 20










// 3. unenq zangvatc [1,2,56,78,9,36,32,12]
// tpel zangvatci meji ayn andamner@ voronq bajanvum en 3i vra












// 4 unenq zangvatc [1,"fds",2,56,"78",9,36,32,"dsff",12]
// tpel zangvatci  ayn andamner@ voronq patkanum en string tipin











// 5.[1,"fds",2,56,"78",9,36,"hello",32,"dsff",12]
// unenq zanvatc petq e vradarcnenq zangvati a yn arjeqi index@ vor havasar e "hello"













// 6.[1,"fds",2,"fdsf",56,"78",9,36,"hello",32,"dsff",12,"dsada",43,"fdsdsfs"]
// unenq zangvatc petq e veradarcnel bolor number tipin patkanox arjeqneri qanak@


















// 7)Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран














// 8)Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран 
// столбец тех элементов массива, которые больше 3-х, но меньше 10














// 9) Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла for и оператора if проверьте 
// есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла.
//  Если нет - ничего делать не надо.


















// 10)Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится?


















// 11)Выведите столбец чисел от 11 до 33. 















// 12.Дан массив ['Привет, ', 'мир', '!']. Необходимо записать в нулевой элемент этого массива слово 'Пока, '
//  (то есть вместо слова 'Привет, ' будет 'Пока, ').
















// 13.Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx
















// 14.Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:

// xx
// xxxx
// xxxxxx
// xxxxxxxx
// xxxxxxxxxx