// 1. Напишите функцию JavaScript, чтобы получить количество дней в месяц.







// 2. Напишите функцию JavaScript, чтобы получить имя месяца с определенной даты.







// 3. Напишите функцию JavaScript для сравнения дат .









// 4. Напишите функцию JavaScript, чтобы проверить, является ли дата выходным. 










// 5. Напишите функцию JavaScript, чтобы получить разницу между двумя датами в днях. 









// 6. Напишите функцию JavaScript, чтобы получить последний день месяца. 










// 7. Напишите функцию JavaScript для вычисления «вчерашнего дня». 










// 8. Напишите функцию JavaScript, чтобы получить количество дней в году.










// 9. Напишите функцию JavaScript, чтобы подсчитать количество дней, прошедших с начала года.










// 10. Напишите функцию JavaScript, чтобы получить временные разницы в часах между двумя датами.