1. Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, --. Количество строк кода при этом не должно измениться. Код для переделки:

var num = 1;
num = num + 12;
num = num - 14;
num = num * 5;
num = num / 7;
num = num + 1;
num = num - 1;
alert(num);


2. Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'.



3. С помощью массива arr = ['a', 'b', 'c']  выведите на экран содержимое первого, второго и третьего элементов.



4. Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.


5. Создайте массив arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй, а третий элемент на четвертый.
   Результаты сложите, присвойте переменной result. Выведите на экран значение этой переменной. 


6. Дан массив [ [1, 2, 3], [4, 5, 6], [7,8,9] ]. Выведите на экран цифру 4 из этого массива.



7. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.


8. В переменной min лежит число от 0 до 59. 
  Определите в какую четверть часа попадает это число (в первую, вторую, третью или четвертую).


9.Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
 Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.


10.Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. 
Проверьте работу скрипта при a, равном 5, 0, -3, 2


11.Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных,
 иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.



12.Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти,
 то выведите 'Верно', в противном случае выведите 'Неверно'.


13.Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1', то в переменную result запишем 'зима',
 если имеет значение '2' – 'весна' и так далее. Решите задачу через "switch-case" .


14. Выведите столбец чисел от 1 до 50.воспользуемся циклом while (отделим числа тегом br друг от друга, чтобы получить столбец, а не строку)
 (document.write())


15.Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.


16.var arr = [2, -1, -3, 15, 0, 4];Дан массив с числами. Числа могут быть положительными и отрицательными.
 Найдите сумму положительных элементов массива.


17.Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'. 


18. Составьте массив дней недели. С помощью цикла for выведите все дни недели, а текущий день выведите курсивом.
 Текущий день должен храниться в переменной day
 var arr = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'];
day = 3; //пусть сегодня четверг


19.Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится?
 Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.
